telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
static const uint8_t k_log_rate_options[] = {1u, 5u, 10u, 20u, 30u, 40u, 50u};
static uint16_t s_gyro_peak_dps = 0u;
static i3c_bus_type_t s_temp_bus_type = kI3C_TypeI2C;
static power_sample_t s_frame_sample;
static anomaly_output_t s_anom_out;
static bool BoardTempI3CInit(void);
static bool TouchI2CInit(void);
static bool AccelI2CInit(void);
static void ShieldGyroInit(void);
static uint32_t CoreClockHz(void);
static bool ShieldImuSupportsShub(uint8_t who);
static uint64_t TimebaseNowTicks(void);

typedef struct
{
    uint8_t addr;
    uint8_t reg;
    const char *name;
} diag_probe_t;

static const diag_probe_t kDiagProbes[] = {
    {0x6Au, 0x0Fu, "IMU_A"},
    {0x6Bu, 0x0Fu, "IMU_B"},
    {0x18u, 0x0Fu, "LIS2DUXS12_A"},
    {0x19u, 0x0Fu, "LIS2DUXS12_B"},
    {0x1Eu, 0x4Fu, "LIS2MDL"},
    {0x5Cu, 0x0Fu, "LPS22DF_A"},
    {0x5Du, 0x0Fu, "LPS22DF_B"},
    {0x44u, 0x89u, "SHT4x_CMD"},
    {0x45u, 0x89u, "SHT4x_CMD_ALT"},
    {0x5Du, 0x0Fu, "STTS22H?"},
    {0x3Cu, 0x4Fu, "LIS2MDL_ALT8"},
};

static bool s_accel_log_peak_valid = false;
static int16_t s_accel_log_peak_x_mg = 0;
static int16_t s_accel_log_peak_y_mg = 0;
static int16_t s_accel_log_peak_z_mg = 0;
static bool s_accel_capture_peak_valid = false;
static int16_t s_accel_capture_peak_x_mg = 0;
static int16_t s_accel_capture_peak_y_mg = 0;
static int16_t s_accel_capture_peak_z_mg = 0;
static bool s_gyro_log_peak_valid = false;
static int16_t s_gyro_log_peak_x_mg = 0;
static int16_t s_gyro_log_peak_y_mg = 0;
static int16_t s_gyro_log_peak_z_mg = 0;
static bool s_gyro_capture_peak_valid = false;
static int16_t s_gyro_capture_peak_x_mg = 0;
static int16_t s_gyro_capture_peak_y_mg = 0;
static int16_t s_gyro_capture_peak_z_mg = 0;
static bool s_mag_log_peak_valid = false;
static int16_t s_mag_log_peak_x_mgauss = 0;
static int16_t s_mag_log_peak_y_mgauss = 0;
static int16_t s_mag_log_peak_z_mgauss = 0;
static bool s_mag_capture_peak_valid = false;
static int16_t s_mag_capture_peak_x_mgauss = 0;
static int16_t s_mag_capture_peak_y_mgauss = 0;
static int16_t s_mag_capture_peak_z_mgauss = 0;

static int16_t SelectSignedPeakAbs(int16_t current_peak, int16_t sample)
{
    int32_t p = (current_peak < 0) ? -current_peak : current_peak;
    int32_t s = (sample < 0) ? -sample : sample;
    return (s > p) ? sample : current_peak;
}

static void ResetSignalPeakWindows(void)
{
    s_accel_log_peak_valid = false;
    s_accel_capture_peak_valid = false;
    s_gyro_log_peak_valid = false;
    s_gyro_capture_peak_valid = false;
    s_mag_log_peak_valid = false;
    s_mag_capture_peak_valid = false;
}

static void UpdateSignalPeakWindows(void)
{
    if (!s_accel_log_peak_valid)
    {
        s_accel_log_peak_x_mg = s_accel_x_mg;
        s_accel_log_peak_y_mg = s_accel_y_mg;
        s_accel_log_peak_z_mg = s_accel_z_mg;
        s_accel_log_peak_valid = true;
    }
    else
    {
        s_accel_log_peak_x_mg = SelectSignedPeakAbs(s_accel_log_peak_x_mg, s_accel_x_mg);
        s_accel_log_peak_y_mg = SelectSignedPeakAbs(s_accel_log_peak_y_mg, s_accel_y_mg);
        s_accel_log_peak_z_mg = SelectSignedPeakAbs(s_accel_log_peak_z_mg, s_accel_z_mg);
    }

    if (!s_accel_capture_peak_valid)
    {
        s_accel_capture_peak_x_mg = s_accel_x_mg;
        s_accel_capture_peak_y_mg = s_accel_y_mg;
        s_accel_capture_peak_z_mg = s_accel_z_mg;
        s_accel_capture_peak_valid = true;
    }
    else
    {
        s_accel_capture_peak_x_mg = SelectSignedPeakAbs(s_accel_capture_peak_x_mg, s_accel_x_mg);
        s_accel_capture_peak_y_mg = SelectSignedPeakAbs(s_accel_capture_peak_y_mg, s_accel_y_mg);
        s_accel_capture_peak_z_mg = SelectSignedPeakAbs(s_accel_capture_peak_z_mg, s_accel_z_mg);
    }

    if (!s_gyro_log_peak_valid)
    {
        s_gyro_log_peak_x_mg = s_live_gyro_x_dps;
        s_gyro_log_peak_y_mg = s_live_gyro_y_dps;
        s_gyro_log_peak_z_mg = s_live_gyro_z_dps;
        s_gyro_log_peak_valid = true;
    }
    else
    {
        s_gyro_log_peak_x_mg = SelectSignedPeakAbs(s_gyro_log_peak_x_mg, s_live_gyro_x_dps);
        s_gyro_log_peak_y_mg = SelectSignedPeakAbs(s_gyro_log_peak_y_mg, s_live_gyro_y_dps);
        s_gyro_log_peak_z_mg = SelectSignedPeakAbs(s_gyro_log_peak_z_mg, s_live_gyro_z_dps);
    }

    if (!s_gyro_capture_peak_valid)
    {
        s_gyro_capture_peak_x_mg = s_live_gyro_x_dps;
        s_gyro_capture_peak_y_mg = s_live_gyro_y_dps;
        s_gyro_capture_peak_z_mg = s_live_gyro_z_dps;
        s_gyro_capture_peak_valid = true;
    }
    else
    {
        s_gyro_capture_peak_x_mg = SelectSignedPeakAbs(s_gyro_capture_peak_x_mg, s_live_gyro_x_dps);
        s_gyro_capture_peak_y_mg = SelectSignedPeakAbs(s_gyro_capture_peak_y_mg, s_live_gyro_y_dps);
        s_gyro_capture_peak_z_mg = SelectSignedPeakAbs(s_gyro_capture_peak_z_mg, s_live_gyro_z_dps);
    }

    if (!s_mag_log_peak_valid)
    {
        s_mag_log_peak_x_mgauss = s_mag_x_mgauss;
        s_mag_log_peak_y_mgauss = s_mag_y_mgauss;
        s_mag_log_peak_z_mgauss = s_mag_z_mgauss;
        s_mag_log_peak_valid = true;
    }
    else
    {
        s_mag_log_peak_x_mgauss = SelectSignedPeakAbs(s_mag_log_peak_x_mgauss, s_mag_x_mgauss);
        s_mag_log_peak_y_mgauss = SelectSignedPeakAbs(s_mag_log_peak_y_mgauss, s_mag_y_mgauss);
        s_mag_log_peak_z_mgauss = SelectSignedPeakAbs(s_mag_log_peak_z_mgauss, s_mag_z_mgauss);
    }

    if (!s_mag_capture_peak_valid)
    {
        s_mag_capture_peak_x_mgauss = s_mag_x_mgauss;
        s_mag_capture_peak_y_mgauss = s_mag_y_mgauss;
        s_mag_capture_peak_z_mgauss = s_mag_z_mgauss;
        s_mag_capture_peak_valid = true;
    }
    else
    {
        s_mag_capture_peak_x_mgauss = SelectSignedPeakAbs(s_mag_capture_peak_x_mgauss, s_mag_x_mgauss);
        s_mag_capture_peak_y_mgauss = SelectSignedPeakAbs(s_mag_capture_peak_y_mgauss, s_mag_y_mgauss);
        s_mag_capture_peak_z_mgauss = SelectSignedPeakAbs(s_mag_capture_peak_z_mgauss, s_mag_z_mgauss);
    }
}

static void ConsumeLogPeaks(int16_t *ax_mg,
                            int16_t *ay_mg,
                            int16_t *az_mg,
                            int16_t *gx,
                            int16_t *gy,
                            int16_t *gz,
                            int16_t *mx,
                            int16_t *my,
                            int16_t *mz)
{
    if ((ax_mg == NULL) || (ay_mg == NULL) || (az_mg == NULL) || (gx == NULL) || (gy == NULL) || (gz == NULL) ||
        (mx == NULL) || (my == NULL) || (mz == NULL))
    {
        return;
    }
    if (s_accel_log_peak_valid)
    {
        *ax_mg = s_accel_log_peak_x_mg;
        *ay_mg = s_accel_log_peak_y_mg;
        *az_mg = s_accel_log_peak_z_mg;
    }
    else
    {
        *ax_mg = s_accel_x_mg;
        *ay_mg = s_accel_y_mg;
        *az_mg = s_accel_z_mg;
    }

    if (s_gyro_log_peak_valid)
    {
        *gx = s_gyro_log_peak_x_mg;
        *gy = s_gyro_log_peak_y_mg;
        *gz = s_gyro_log_peak_z_mg;
    }
    else
    {
        *gx = s_live_gyro_x_dps;
        *gy = s_live_gyro_y_dps;
        *gz = s_live_gyro_z_dps;
    }

