telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
    if (s_mag_log_peak_valid)
    {
        *mx = s_mag_log_peak_x_mgauss;
        *my = s_mag_log_peak_y_mgauss;
        *mz = s_mag_log_peak_z_mgauss;
    }
    else
    {
        *mx = s_mag_x_mgauss;
        *my = s_mag_y_mgauss;
        *mz = s_mag_z_mgauss;
    }
    s_accel_log_peak_valid = false;
    s_gyro_log_peak_valid = false;
    s_mag_log_peak_valid = false;
}

static void ConsumeCapturePeaks(int16_t *ax_mg,
                                int16_t *ay_mg,
                                int16_t *az_mg,
                                int16_t *gx,
                                int16_t *gy,
                                int16_t *gz,
                                int16_t *mx,
                                int16_t *my,
                                int16_t *mz)
{
    if ((ax_mg == NULL) || (ay_mg == NULL) || (az_mg == NULL) || (gx == NULL) || (gy == NULL) || (gz == NULL) ||
        (mx == NULL) || (my == NULL) || (mz == NULL))
    {
        return;
    }
    if (s_accel_capture_peak_valid)
    {
        *ax_mg = s_accel_capture_peak_x_mg;
        *ay_mg = s_accel_capture_peak_y_mg;
        *az_mg = s_accel_capture_peak_z_mg;
    }
    else
    {
        *ax_mg = s_accel_x_mg;
        *ay_mg = s_accel_y_mg;
        *az_mg = s_accel_z_mg;
    }

    if (s_gyro_capture_peak_valid)
    {
        *gx = s_gyro_capture_peak_x_mg;
        *gy = s_gyro_capture_peak_y_mg;
        *gz = s_gyro_capture_peak_z_mg;
    }
    else
    {
        *gx = s_live_gyro_x_dps;
        *gy = s_live_gyro_y_dps;
        *gz = s_live_gyro_z_dps;
    }

    if (s_mag_capture_peak_valid)
    {
        *mx = s_mag_capture_peak_x_mgauss;
        *my = s_mag_capture_peak_y_mgauss;
        *mz = s_mag_capture_peak_z_mgauss;
    }
    else
    {
        *mx = s_mag_x_mgauss;
        *my = s_mag_y_mgauss;
        *mz = s_mag_z_mgauss;
    }
    s_accel_capture_peak_valid = false;
    s_gyro_capture_peak_valid = false;
    s_mag_capture_peak_valid = false;
}

static void ClockFromDeciseconds(uint32_t ds_total, uint16_t *hh, uint8_t *mm, uint8_t *ss, uint8_t *ds)
{
    uint32_t sec_total = ds_total / 10u;
    uint32_t rem_ds = ds_total % 10u;
    uint32_t hh_v = sec_total / 3600u;
    uint32_t mm_v = (sec_total % 3600u) / 60u;
    uint32_t ss_v = sec_total % 60u;

    if (hh != NULL)
    {
        *hh = (uint16_t)((hh_v > 9999u) ? 9999u : hh_v);
    }
    if (mm != NULL)
    {
        *mm = (uint8_t)mm_v;
    }
    if (ss != NULL)
    {
        *ss = (uint8_t)ss_v;
    }
    if (ds != NULL)
    {
        *ds = (uint8_t)rem_ds;
    }
}

static uint8_t ChannelLevelPct(anomaly_level_t lvl)
{
    if (lvl >= ANOMALY_LEVEL_MAJOR)
    {
        return 100u;
    }
    if (lvl >= ANOMALY_LEVEL_MINOR)
    {
        return 80u;
    }
    if (lvl >= ANOMALY_LEVEL_WATCH)
    {
        return 40u;
    }
    return 5u;
}

static uint8_t AlertReasonWarningPriority(uint8_t reason)
{
    switch (reason)
    {
        case ALERT_REASON_ACCEL_WARN:
        case ALERT_REASON_TEMP_WARN:
        case ALERT_REASON_GYRO_WARN:
            return 90u;
        case ALERT_REASON_ERRATIC_MOTION:
            return 80u;
        case ALERT_REASON_INVERTED_WARN:
            return 75u;
        case ALERT_REASON_TILT_WARN:
            return 70u;
        case ALERT_REASON_TEMP_APPROACH_LOW:
        case ALERT_REASON_TEMP_APPROACH_HIGH:
            return 60u;
        case ALERT_REASON_SCORE_WARN:
            return 50u;
        case ALERT_REASON_ANOMALY_WATCH:
            return 40u;
        default:
            return 0u;
    }
}

static void ApplyAnomalyToFrame(power_sample_t *dst)
{
    static bool s_motion_prev_valid = false;
    static int16_t s_prev_ax_mg = 0;
    static int16_t s_prev_ay_mg = 0;
    static int16_t s_prev_az_mg = 0;
    static uint8_t s_alert_hold_status = AI_STATUS_NORMAL;
    static uint8_t s_alert_hold_reason = ALERT_REASON_NORMAL;
    static uint64_t s_alert_hold_until_ticks = 0ull;
    const eil_profile_t *profile = EilProfile_Get();
    const uint64_t hold_warn_ticks = (uint64_t)s_timebase_hz * 5ull;
    const uint64_t hold_fault_ticks = (uint64_t)s_timebase_hz * 8ull;
    uint8_t ax = ChannelLevelPct(s_anom_out.channel_level[ANOMALY_CH_AX]);
    uint8_t ay = ChannelLevelPct(s_anom_out.channel_level[ANOMALY_CH_AY]);
    uint8_t az = ChannelLevelPct(s_anom_out.channel_level[ANOMALY_CH_AZ]);
    uint8_t tp = ChannelLevelPct(s_anom_out.channel_level[ANOMALY_CH_TEMP]);
    float w_ax = 1.0f;
    float w_ay = 1.0f;
    float w_az = 1.0f;
    float w_tp = 1.0f;
    float weighted_pct;
    float weight_sum;
    uint8_t maxch = ax;
    int32_t abx;
    int32_t aby;
    int32_t abz;
    int32_t dax = 0;
    int32_t day = 0;
    int32_t daz = 0;
    int32_t jerk_peak;
    uint16_t accel_peak_mg;
    bool accel_warn_hit;
    bool accel_fail_hit;
    bool temp_limit_hit;
    bool temp_fail_hit;
    bool gyro_limit_hit;
    bool predicted_inverted_warn;
    bool predicted_tilt_warn;
    bool predicted_temp_approach_low;
    bool predicted_temp_approach_high;
    bool predicted_erratic_motion;
    uint16_t gyro_predict_warn_dps;
    uint64_t now_ticks = TimebaseNowTicks();

    if (dst == NULL)
    {
        return;
    }

    if (ay > maxch)
    {
        maxch = ay;
    }
    if (az > maxch)
    {
        maxch = az;
    }
    if (tp > maxch)
    {
        maxch = tp;
    }

    if (profile != NULL)
    {
        w_ax = profile->weight_ax;
        w_ay = profile->weight_ay;
        w_az = profile->weight_az;
        w_tp = profile->weight_temp_c;
    }
    if (w_ax < 0.0f)
    {
        w_ax = 0.0f;
    }
    if (w_ay < 0.0f)
    {
        w_ay = 0.0f;
    }
    if (w_az < 0.0f)
    {
        w_az = 0.0f;
    }
    if (w_tp < 0.0f)
    {
        w_tp = 0.0f;
    }

    weight_sum = w_ax + w_ay + w_az + w_tp;
    if (weight_sum > 0.0f)
    {
        weighted_pct = ((float)ax * w_ax + (float)ay * w_ay + (float)az * w_az + (float)tp * w_tp) / weight_sum;
    }
    else
    {
        weighted_pct = (float)maxch;
    }
    if (weighted_pct < 0.0f)
    {
        weighted_pct = 0.0f;
    }
    if (weighted_pct > 100.0f)
    {
        weighted_pct = 100.0f;
    }

    dst->anomaly_score_pct = (uint16_t)(weighted_pct + 0.5f);
    dst->connector_risk_pct = ax;
    dst->wire_risk_pct = ay;
    dst->thermal_damage_risk_pct = tp;
    dst->degradation_drift_pct = az;
    dst->thermal_risk_s = 0u;
    dst->alert_reason_code = ALERT_REASON_NORMAL;

