telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
    abx = (s_accel_x_mg < 0) ? -s_accel_x_mg : s_accel_x_mg;
    aby = (s_accel_y_mg < 0) ? -s_accel_y_mg : s_accel_y_mg;
    abz = (s_accel_z_mg < 0) ? -s_accel_z_mg : s_accel_z_mg;
    accel_peak_mg = (uint16_t)abx;
    if ((uint16_t)aby > accel_peak_mg)
    {
        accel_peak_mg = (uint16_t)aby;
    }
    if ((uint16_t)abz > accel_peak_mg)
    {
        accel_peak_mg = (uint16_t)abz;
    }

    accel_warn_hit = (accel_peak_mg >= s_limit_g_warn_mg);
    accel_fail_hit = (accel_peak_mg >= s_limit_g_fail_mg);
    temp_limit_hit = (s_temp_c10 < s_limit_temp_lo_c10) || (s_temp_c10 > s_limit_temp_hi_c10);
    temp_fail_hit = (s_temp_c10 < (s_limit_temp_lo_c10 - 100)) || (s_temp_c10 > (s_limit_temp_hi_c10 + 100));
    gyro_limit_hit = (s_gyro_peak_dps >= s_limit_gyro_dps);
    if (s_motion_prev_valid)
    {
        dax = (int32_t)s_accel_x_mg - (int32_t)s_prev_ax_mg;
        day = (int32_t)s_accel_y_mg - (int32_t)s_prev_ay_mg;
        daz = (int32_t)s_accel_z_mg - (int32_t)s_prev_az_mg;
        dax = (dax < 0) ? -dax : dax;
        day = (day < 0) ? -day : day;
        daz = (daz < 0) ? -daz : daz;
    }
    jerk_peak = dax;
    if (day > jerk_peak)
    {
        jerk_peak = day;
    }
    if (daz > jerk_peak)
    {
        jerk_peak = daz;
    }

    predicted_inverted_warn = (s_accel_z_mg <= -700) && (abx <= 600) && (aby <= 600);
    predicted_tilt_warn = !predicted_inverted_warn && ((abx >= 600) || (aby >= 600)) && !accel_warn_hit;
    predicted_temp_approach_low = !temp_limit_hit && !temp_fail_hit && (s_temp_c10 <= (s_limit_temp_lo_c10 + 30));
    predicted_temp_approach_high = !temp_limit_hit && !temp_fail_hit && (s_temp_c10 >= (s_limit_temp_hi_c10 - 30));
    gyro_predict_warn_dps = (uint16_t)((s_limit_gyro_dps * 7u) / 10u);
    predicted_erratic_motion = !accel_warn_hit &&
                               ((jerk_peak >= 2200) ||
                                ((s_gyro_peak_dps >= gyro_predict_warn_dps) && (jerk_peak >= 1400)));

    if (accel_fail_hit || temp_fail_hit)
    {
        dst->ai_status = AI_STATUS_FAULT;
        dst->alert_reason_code = accel_fail_hit ? ALERT_REASON_ACCEL_FAIL : ALERT_REASON_TEMP_FAIL;
    }
    else if (accel_warn_hit || temp_limit_hit || gyro_limit_hit)
    {
        dst->ai_status = AI_STATUS_WARNING;
        if (accel_warn_hit)
        {
            dst->alert_reason_code = ALERT_REASON_ACCEL_WARN;
        }
        else if (temp_limit_hit)
        {
            dst->alert_reason_code = ALERT_REASON_TEMP_WARN;
        }
        else
        {
            dst->alert_reason_code = ALERT_REASON_GYRO_WARN;
        }
    }
    else if (predicted_inverted_warn)
    {
        dst->ai_status = AI_STATUS_WARNING;
        dst->alert_reason_code = ALERT_REASON_INVERTED_WARN;
    }
    else if (predicted_tilt_warn)
    {
        dst->ai_status = AI_STATUS_WARNING;
        dst->alert_reason_code = ALERT_REASON_TILT_WARN;
    }
    else if (predicted_temp_approach_low)
    {
        dst->ai_status = AI_STATUS_WARNING;
        dst->alert_reason_code = ALERT_REASON_TEMP_APPROACH_LOW;
    }
    else if (predicted_temp_approach_high)
    {
        dst->ai_status = AI_STATUS_WARNING;
        dst->alert_reason_code = ALERT_REASON_TEMP_APPROACH_HIGH;
    }
    else if (predicted_erratic_motion)
    {
        dst->ai_status = AI_STATUS_WARNING;
        dst->alert_reason_code = ALERT_REASON_ERRATIC_MOTION;
    }
    else if ((profile != NULL) && ((weighted_pct / 100.0f) >= profile->alert_fail))
    {
        dst->ai_status = AI_STATUS_FAULT;
        dst->alert_reason_code = ALERT_REASON_SCORE_FAIL;
    }
    else if ((profile != NULL) && ((weighted_pct / 100.0f) >= profile->alert_warn))
    {
        dst->ai_status = AI_STATUS_WARNING;
        dst->alert_reason_code = ALERT_REASON_SCORE_WARN;
    }
    else if (s_anom_out.overall_level >= ANOMALY_LEVEL_WATCH)
    {
        dst->ai_status = AI_STATUS_WARNING;
        dst->alert_reason_code = ALERT_REASON_ANOMALY_WATCH;
    }
    else
    {
        dst->ai_status = AI_STATUS_NORMAL;
        dst->alert_reason_code = ALERT_REASON_NORMAL;
    }

    /* Keep warning/fault visible, while always prioritizing higher-severity alerts. */
    if (dst->ai_status == AI_STATUS_FAULT)
    {
        s_alert_hold_status = dst->ai_status;
        s_alert_hold_reason = dst->alert_reason_code;
        s_alert_hold_until_ticks = now_ticks + hold_fault_ticks;
    }
    else if (dst->ai_status == AI_STATUS_WARNING)
    {
        bool hold_active = (s_alert_hold_status != AI_STATUS_NORMAL) && (now_ticks < s_alert_hold_until_ticks);
        if (!hold_active || (s_alert_hold_status == AI_STATUS_NORMAL))
        {
            s_alert_hold_status = dst->ai_status;
            s_alert_hold_reason = dst->alert_reason_code;
            s_alert_hold_until_ticks = now_ticks + hold_warn_ticks;
        }
        else if (s_alert_hold_status == AI_STATUS_FAULT)
        {
            dst->ai_status = s_alert_hold_status;
            dst->alert_reason_code = s_alert_hold_reason;
        }
        else
        {
            uint8_t live_pri = AlertReasonWarningPriority(dst->alert_reason_code);
            uint8_t hold_pri = AlertReasonWarningPriority(s_alert_hold_reason);
            if (live_pri >= hold_pri)
            {
                s_alert_hold_status = dst->ai_status;
                s_alert_hold_reason = dst->alert_reason_code;
                s_alert_hold_until_ticks = now_ticks + hold_warn_ticks;
            }
            else
            {
                dst->ai_status = s_alert_hold_status;
                dst->alert_reason_code = s_alert_hold_reason;
            }
        }
    }
    else if ((s_alert_hold_status != AI_STATUS_NORMAL) && (now_ticks < s_alert_hold_until_ticks))
    {
        dst->ai_status = s_alert_hold_status;
        dst->alert_reason_code = s_alert_hold_reason;
    }
    else
    {
        s_alert_hold_status = AI_STATUS_NORMAL;
        s_alert_hold_reason = ALERT_REASON_NORMAL;
    }

    dst->ai_fault_flags = 0u;
    s_prev_ax_mg = s_accel_x_mg;
    s_prev_ay_mg = s_accel_y_mg;
    s_prev_az_mg = s_accel_z_mg;
    s_motion_prev_valid = true;
}

static void AccelAxisSelfTestLog(void)
{
#if EDGEAI_ENABLE_ACCEL_TEST_LOG
    int32_t ax = s_accel_x_mg;
    int32_t ay = s_accel_y_mg;
    int32_t az = s_accel_z_mg;
    int32_t abx = (ax < 0) ? -ax : ax;
    int32_t aby = (ay < 0) ? -ay : ay;
    int32_t abz = (az < 0) ? -az : az;
    char axis = 'X';
    int32_t val = ax;

    if (aby > abx)
    {
        axis = 'Y';
        val = ay;
        abx = aby;
    }
    if (abz > abx)
    {
        axis = 'Z';
        val = az;
    }

    PRINTF("ACCEL_TEST,DOM=%c%s,X=%d,Y=%d,Z=%d\r\n",
           axis, (val >= 0) ? "+" : "-", (int)ax, (int)ay, (int)az);
#else
    /* Disabled by default to avoid periodic UART blocking in the render loop. */
#endif
}

