telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
static void TouchDelayMs(uint32_t delay_ms)
{
    SDK_DelayAtLeastUs(delay_ms * 1000u, CoreClockHz());
}

static bool TimebaseInit(void)
{
    status_t st = CLOCK_SetupOsc32KClocking(kCLOCK_Osc32kToWake);
    uint32_t cfg_hz;
    uint32_t measured_hz = 0u;
    uint64_t t0;
    uint64_t t1;

    CLOCK_AttachClk(kXTAL32K2_to_OSTIMER);
    OSTIMER_Init(OSTIMER0);
    cfg_hz = CLOCK_GetOstimerClkFreq();

    s_timebase_use_core_cycle = false;
    s_timebase_use_raw = false;
    s_timebase_hz = (cfg_hz != 0u) ? cfg_hz : EDGEAI_TIMEBASE_CRYSTAL_HZ;

    /* Calibrate effective OSTIMER tick rate against CPU delay, then quantize to expected divisors. */
    t0 = OSTIMER_GetCurrentTimerValue(OSTIMER0);
    SDK_DelayAtLeastUs(EDGEAI_TIMEBASE_CAL_WINDOW_US, CoreClockHz());
    t1 = OSTIMER_GetCurrentTimerValue(OSTIMER0);
    if (t1 > t0)
    {
        measured_hz = (uint32_t)(((t1 - t0) * 1000000ull) / EDGEAI_TIMEBASE_CAL_WINDOW_US);
    }
    if (measured_hz != 0u)
    {
        /* Accept measured tick rate when plausible; avoid forcing a wrong nominal divisor. */
        if ((measured_hz >= (s_timebase_hz / 2u)) && (measured_hz <= (s_timebase_hz * 2u)))
        {
            s_timebase_hz = measured_hz;
        }
    }

    PRINTF("TIMEBASE: src=ostimer32k setup=%d cfg=%u meas=%u use=%u raw=%u\r\n",
           (int)st,
           (unsigned int)cfg_hz,
           (unsigned int)measured_hz,
           (unsigned int)s_timebase_hz,
           (unsigned int)s_timebase_use_raw);
    s_timebase_ready = true;
    return true;
}

static uint64_t TimebaseNowTicks(void)
{
    if (s_timebase_use_core_cycle)
    {
        uint32_t now = DWT->CYCCNT;
        uint32_t delta = now - s_core_cycle_prev;
        s_core_cycle_prev = now;
        s_core_cycle_accum += (uint64_t)delta;
        return s_core_cycle_accum;
    }
    if (!s_timebase_ready)
    {
        return 0u;
    }
    return s_timebase_use_raw ? OSTIMER_GetCurrentTimerRawValue(OSTIMER0) : OSTIMER_GetCurrentTimerValue(OSTIMER0);
}

static void DelayUsByTimebase(uint32_t delay_us)
{
    uint64_t start_ticks;
    uint64_t wait_ticks;

    if (!s_timebase_ready)
    {
        SDK_DelayAtLeastUs(delay_us, CoreClockHz());
        return;
    }

    start_ticks = TimebaseNowTicks();
    wait_ticks = ((uint64_t)delay_us * s_timebase_hz) / 1000000ull;
    if (wait_ticks == 0u)
    {
        wait_ticks = 1u;
    }
    while ((TimebaseNowTicks() - start_ticks) < wait_ticks)
    {
    }
}

static uint32_t CoreClockHz(void)
{
    uint32_t hz = CLOCK_GetCoreSysClkFreq();
    if (hz == 0u)
    {
        hz = SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY;
    }
    return hz;
}

static bool TouchI2CRecover(void)
{
    s_touch_i2c_inited = false;
    LPI2C_MasterDeinit(TOUCH_I2C);
    return TouchI2CInit();
}

static bool TouchI2CInit(void)
{
    uint32_t src_hz;
    lpi2c_master_config_t cfg;

    if (s_touch_i2c_inited)
    {
        return true;
    }

    CLOCK_SetClkDiv(kCLOCK_DivFlexcom2Clk, 1u);
    CLOCK_AttachClk(kFRO12M_to_FLEXCOMM2);

    src_hz = CLOCK_GetLPFlexCommClkFreq(TOUCH_I2C_FLEXCOMM_INDEX);
    if (src_hz == 0u)
    {
        PRINTF("TOUCH i2c init failed: FC2 clock=0\r\n");
        return false;
    }

    LPI2C_MasterGetDefaultConfig(&cfg);
    /* Shared bus (GT911 + ST sensor shield): keep conservative speed for stability. */
    cfg.baudRate_Hz = 100000u;
    LPI2C_MasterInit(TOUCH_I2C, &cfg, src_hz);
    s_touch_i2c_inited = true;
    return true;
}

static bool AccelI2CRecover(void)
{
    s_accel_i2c_inited = false;
    LPI2C_MasterDeinit(ACCEL_I2C);
    return AccelI2CInit();
}

static bool AccelI2CInit(void)
{
    uint32_t src_hz;
    lpi2c_master_config_t cfg;

    if (s_accel_i2c_inited)
    {
        return true;
    }

    CLOCK_SetClkDiv(kCLOCK_DivFlexcom3Clk, 1u);
    CLOCK_AttachClk(kFRO12M_to_FLEXCOMM3);

    src_hz = CLOCK_GetLPFlexCommClkFreq(ACCEL_I2C_FLEXCOMM_INDEX);
    if (src_hz == 0u)
    {
        PRINTF("ACCEL i2c init failed: FC3 clock=0\r\n");
        return false;
    }

    LPI2C_MasterGetDefaultConfig(&cfg);
    cfg.baudRate_Hz = 100000u;
    LPI2C_MasterInit(ACCEL_I2C, &cfg, src_hz);
    s_accel_i2c_inited = true;
    return true;
}

static bool ShieldBusTransferWithRetry(bool use_touch_bus, lpi2c_master_transfer_t *xfer)
{
    LPI2C_Type *base = use_touch_bus ? TOUCH_I2C : ACCEL_I2C;
    bool inited = use_touch_bus ? TouchI2CInit() : AccelI2CInit();
    uint32_t attempt;

    if (!inited || (xfer == NULL))
    {
        return false;
    }

    for (attempt = 0u; attempt < EDGEAI_I2C_RETRY_COUNT; attempt++)
    {
        if (LPI2C_MasterTransferBlocking(base, xfer) == kStatus_Success)
        {
            return true;
        }
        if (use_touch_bus)
        {
            (void)TouchI2CRecover();
        }
        else
        {
            (void)AccelI2CRecover();
        }
        SDK_DelayAtLeastUs(300u, CoreClockHz());
    }

    return false;
}

static status_t TouchI2CSend(uint8_t deviceAddress,
                             uint32_t subAddress,
                             uint8_t subaddressSize,
                             const uint8_t *txBuff,
                             uint8_t txBuffSize)
{
    lpi2c_master_transfer_t xfer;
    status_t st;
    uint32_t attempt;
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = deviceAddress;
    xfer.direction = kLPI2C_Write;
    xfer.subaddress = subAddress;
    xfer.subaddressSize = subaddressSize;
    xfer.data = (uint8_t *)(uintptr_t)txBuff;
    xfer.dataSize = txBuffSize;
    st = kStatus_Fail;
    for (attempt = 0u; attempt < EDGEAI_I2C_RETRY_COUNT; attempt++)
    {
        st = LPI2C_MasterTransferBlocking(TOUCH_I2C, &xfer);
        if (st == kStatus_Success)
        {
            break;
        }
        (void)TouchI2CRecover();
        SDK_DelayAtLeastUs(250u, CoreClockHz());
    }
    return st;
}

static status_t TouchI2CReceive(uint8_t deviceAddress,
                                uint32_t subAddress,
                                uint8_t subaddressSize,
                                uint8_t *rxBuff,
                                uint8_t rxBuffSize)
{
    lpi2c_master_transfer_t xfer;
    status_t st;
    uint32_t attempt;
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = deviceAddress;
    xfer.direction = kLPI2C_Read;
    xfer.subaddress = subAddress;
    xfer.subaddressSize = subaddressSize;
    xfer.data = rxBuff;
    xfer.dataSize = rxBuffSize;
    st = kStatus_Fail;
    for (attempt = 0u; attempt < EDGEAI_I2C_RETRY_COUNT; attempt++)
    {
        st = LPI2C_MasterTransferBlocking(TOUCH_I2C, &xfer);
        if (st == kStatus_Success)
        {
            break;
        }
        (void)TouchI2CRecover();
        SDK_DelayAtLeastUs(250u, CoreClockHz());
    }
    return st;
}

