telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
static bool AccelI2CWrite(uint8_t deviceAddress, uint8_t reg, const uint8_t *txBuff, uint32_t txLen)
{
    lpi2c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = deviceAddress;
    xfer.direction = kLPI2C_Write;
    xfer.subaddress = reg;
    xfer.subaddressSize = 1u;
    xfer.data = (uint8_t *)(uintptr_t)txBuff;
    xfer.dataSize = txLen;
    return (LPI2C_MasterTransferBlocking(ACCEL_I2C, &xfer) == kStatus_Success);
}

static bool AccelI2CRead(uint8_t deviceAddress, uint8_t reg, uint8_t *rxBuff, uint32_t rxLen)
{
    lpi2c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = deviceAddress;
    xfer.direction = kLPI2C_Read;
    xfer.subaddress = reg;
    xfer.subaddressSize = 1u;
    xfer.data = rxBuff;
    xfer.dataSize = rxLen;
    return (LPI2C_MasterTransferBlocking(ACCEL_I2C, &xfer) == kStatus_Success);
}

static bool ShieldBusRead(bool use_touch_bus, uint8_t deviceAddress, uint8_t reg, uint8_t *rxBuff, uint32_t rxLen)
{
    lpi2c_master_transfer_t xfer;

    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = deviceAddress;
    xfer.direction = kLPI2C_Read;
    xfer.subaddress = reg;
    xfer.subaddressSize = 1u;
    xfer.data = rxBuff;
    xfer.dataSize = rxLen;
    return ShieldBusTransferWithRetry(use_touch_bus, &xfer);
}

static bool ShieldBusWriteReg(bool use_touch_bus, uint8_t deviceAddress, uint8_t reg, uint8_t value)
{
    lpi2c_master_transfer_t xfer;

    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = deviceAddress;
    xfer.direction = kLPI2C_Write;
    xfer.subaddress = reg;
    xfer.subaddressSize = 1u;
    xfer.data = &value;
    xfer.dataSize = 1u;
    return ShieldBusTransferWithRetry(use_touch_bus, &xfer);
}

static bool ShieldBusProbeAddress(bool use_touch_bus, uint8_t deviceAddress)
{
    lpi2c_master_transfer_t xfer;

    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = deviceAddress;
    xfer.direction = kLPI2C_Write;
    xfer.subaddress = 0u;
    xfer.subaddressSize = 0u;
    xfer.data = NULL;
    xfer.dataSize = 0u;
    return ShieldBusTransferWithRetry(use_touch_bus, &xfer);
}

static bool ShieldBusWriteRaw(bool use_touch_bus, uint8_t deviceAddress, const uint8_t *txBuff, uint32_t txLen)
{
    lpi2c_master_transfer_t xfer;

    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = deviceAddress;
    xfer.direction = kLPI2C_Write;
    xfer.subaddress = 0u;
    xfer.subaddressSize = 0u;
    xfer.data = (uint8_t *)(uintptr_t)txBuff;
    xfer.dataSize = txLen;
    return ShieldBusTransferWithRetry(use_touch_bus, &xfer);
}

static bool ShieldBusReadRaw(bool use_touch_bus, uint8_t deviceAddress, uint8_t *rxBuff, uint32_t rxLen)
{
    lpi2c_master_transfer_t xfer;

    memset(&xfer, 0, sizeof(xfer));
    xfer.flags = kLPI2C_TransferDefaultFlag;
    xfer.slaveAddress = deviceAddress;
    xfer.direction = kLPI2C_Read;
    xfer.subaddress = 0u;
    xfer.subaddressSize = 0u;
    xfer.data = rxBuff;
    xfer.dataSize = rxLen;
    return ShieldBusTransferWithRetry(use_touch_bus, &xfer);
}

static bool ShieldShubSetAccess(bool enable)
{
    uint8_t value = enable ? SHIELD_SHUB_FUNC_CFG_ACCESS : 0u;
    return ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_GYRO_REG_FUNC_CFG_ACCESS, value);
}

static bool ShieldShubResetMaster(uint8_t master_cfg)
{
    if (!ShieldBusWriteReg(s_shield_use_touch_bus,
                           s_shield_gyro_addr,
                           SHIELD_SHUB_REG_MASTER_CONFIG,
                           (uint8_t)(master_cfg | SHIELD_SHUB_MASTER_RST_REGS)))
    {
        return false;
    }
    return ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_MASTER_CONFIG, master_cfg);
}

static bool ShieldShubReadRegs(uint8_t ext_addr7, uint8_t reg, uint8_t *rx, uint8_t len)
{
    uint8_t master_cfg = 0u;
    uint8_t status = 0u;
    bool ok = false;

    if ((rx == NULL) || (len == 0u) || (len > 6u) || !s_shield_gyro_ready || (s_shield_gyro_addr == 0u))
    {
        return false;
    }

    if (!ShieldShubSetAccess(true))
    {
        return false;
    }

    do
    {
        if (!ShieldBusRead(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_MASTER_CONFIG, &master_cfg, 1u))
        {
            break;
        }
        if (!ShieldShubResetMaster(master_cfg))
        {
            break;
        }
        if (!ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_SLV0_ADD, (uint8_t)((ext_addr7 << 1) | 0x01u)))
        {
            break;
        }
        if (!ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_SLV0_SUBADD, reg))
        {
            break;
        }
        if (!ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_SLV0_CONFIG, (uint8_t)(len & 0x07u)))
        {
            break;
        }
        if (!ShieldBusWriteReg(s_shield_use_touch_bus,
                               s_shield_gyro_addr,
                               SHIELD_SHUB_REG_MASTER_CONFIG,
                               (uint8_t)((master_cfg & 0xF0u) | SHIELD_SHUB_MASTER_SHUB_PU_EN | SHIELD_SHUB_MASTER_ON)))
        {
            break;
        }

        for (uint32_t attempt = 0u; attempt < 16u; attempt++)
        {
            if (!ShieldBusRead(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_STATUS_MASTER, &status, 1u))
            {
                break;
            }
            if ((status & SHIELD_SHUB_STATUS_ENDOP) != 0u)
            {
                break;
            }
            SDK_DelayAtLeastUs(1200u, CoreClockHz());
        }

        if (((status & SHIELD_SHUB_STATUS_ENDOP) == 0u) || ((status & SHIELD_SHUB_STATUS_NACK_MASK) != 0u))
        {
            break;
        }
        if (!ShieldBusRead(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_SENSOR_HUB_1, rx, len))
        {
            break;
        }
        ok = true;
    } while (false);

    (void)ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_MASTER_CONFIG, master_cfg);
    (void)ShieldShubSetAccess(false);
    return ok;
}

static bool ShieldShubWriteReg(uint8_t ext_addr7, uint8_t reg, uint8_t value)
{
    uint8_t master_cfg = 0u;
    uint8_t status = 0u;
    bool ok = false;

    if (!s_shield_gyro_ready || (s_shield_gyro_addr == 0u))
    {
        return false;
    }

    if (!ShieldShubSetAccess(true))
    {
        return false;
    }

    do
    {
        if (!ShieldBusRead(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_MASTER_CONFIG, &master_cfg, 1u))
        {
            break;
        }
        if (!ShieldShubResetMaster(master_cfg))
        {
            break;
        }
        if (!ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_SLV0_ADD, (uint8_t)(ext_addr7 << 1)))
        {
            break;
        }
        if (!ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_SLV0_SUBADD, reg))
        {
            break;
        }
        if (!ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_DATAWRITE_SLV0, value))
        {
            break;
        }
        if (!ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_SLV0_CONFIG, 0x00u))
        {
            break;
        }
        if (!ShieldBusWriteReg(s_shield_use_touch_bus,
                               s_shield_gyro_addr,
                               SHIELD_SHUB_REG_MASTER_CONFIG,
                               (uint8_t)((master_cfg & 0xB0u) | SHIELD_SHUB_MASTER_WRITE_ONCE |
                                         SHIELD_SHUB_MASTER_SHUB_PU_EN | SHIELD_SHUB_MASTER_ON)))
        {
            break;
        }

        for (uint32_t attempt = 0u; attempt < 16u; attempt++)
        {
            if (!ShieldBusRead(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_STATUS_MASTER, &status, 1u))
            {
                break;
            }
            if ((status & SHIELD_SHUB_STATUS_ENDOP) != 0u)
            {
                break;
            }
            SDK_DelayAtLeastUs(1200u, CoreClockHz());
        }

        if (((status & SHIELD_SHUB_STATUS_ENDOP) == 0u) || ((status & SHIELD_SHUB_STATUS_NACK_MASK) != 0u))
        {
            break;
        }
        ok = true;
    } while (false);

    (void)ShieldBusWriteReg(s_shield_use_touch_bus, s_shield_gyro_addr, SHIELD_SHUB_REG_MASTER_CONFIG, master_cfg);
    (void)ShieldShubSetAccess(false);
    return ok;
}

static bool ShieldSht40CrcOk(const uint8_t *buf2, uint8_t crc)
{
    uint8_t c = 0xFFu;
    for (uint32_t i = 0u; i < 2u; i++)
    {
        c ^= buf2[i];
        for (uint32_t b = 0u; b < 8u; b++)
        {
            c = (c & 0x80u) ? (uint8_t)((c << 1) ^ 0x31u) : (uint8_t)(c << 1);
        }
    }
    return (c == crc);
}

static void ShieldAuxSetRenderState(void)
{
    GaugeRender_SetMag(s_mag_x_mgauss,
                       s_mag_y_mgauss,
                       s_mag_z_mgauss,
                       s_shield_mag_ready);
    GaugeRender_SetBaro(s_baro_dhpa, s_shield_baro_ready);
    GaugeRender_SetSht(s_sht_temp_c10, s_sht_rh_dpct, s_shield_sht_ready);
    GaugeRender_SetStts(s_stts_temp_c10, s_shield_stts_ready);
}

static void ShieldAuxInit(void)
{
    static const bool buses[2] = {true, false};
    static const char *bus_name[2] = {"FC2", "FC3"};
    static const uint8_t stts_addrs[] = {0x3Cu, 0x3Du, 0x3Eu, 0x3Fu, 0x38u};
    uint8_t who = 0u;

