telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
    raw12 = (int16_t)((((uint16_t)raw[0] << 8) | raw[1]) >> 4);
    if ((raw12 & 0x0800) != 0)
    {
        raw12 |= (int16_t)0xF000;
    }
    /* P3T1755 is 12-bit, 0.0625C/LSB (1/16 C) => 0.625 tenth-C/LSB. */
    temp_c10 = ((int32_t)raw12 * 5) / 8;

    /* Reject clearly invalid values to avoid latching wrong targets. */
    if ((temp_c10 < -400) || (temp_c10 > 1250))
    {
        return false;
    }

    *temp_c10_out = temp_c10;
    return true;
}

static bool BoardTempDecodeC(const uint8_t *raw, int32_t *temp_c_out)
{
    int32_t temp_c10;
    if ((raw == NULL) || (temp_c_out == NULL))
    {
        return false;
    }
    if (!BoardTempDecodeC10(raw, &temp_c10))
    {
        return false;
    }
    *temp_c_out = temp_c10 / 10;
    return true;
}

static bool BoardTempProbeAddr(uint8_t addr, i3c_bus_type_t bus_type, int32_t *temp_c_out)
{
    uint8_t raw_a[2];
    uint8_t raw_b[2];
    int32_t ta;
    int32_t tb;
    int32_t dt;

    if ((temp_c_out == NULL) || !BoardTempReadRaw(addr, bus_type, raw_a) || !BoardTempReadRaw(addr, bus_type, raw_b))
    {
        return false;
    }
    if (!BoardTempDecodeC(raw_a, &ta) || !BoardTempDecodeC(raw_b, &tb))
    {
        return false;
    }

    dt = ta - tb;
    if (dt < 0)
    {
        dt = -dt;
    }
    if (dt > 3)
    {
        return false;
    }

    *temp_c_out = tb;
    return true;
}

static bool BoardTempI3CInit(void)
{
    i3c_master_config_t cfg;
    uint32_t src_hz;

    if (s_temp_i3c_inited)
    {
        return true;
    }

    src_hz = CLOCK_GetI3cClkFreq(TEMP_I3C_INDEX);
    if (src_hz == 0u)
    {
        PRINTF("TEMP i3c init failed: I3C1 clock=0\r\n");
        return false;
    }

    I3C_MasterGetDefaultConfig(&cfg);
    cfg.baudRate_Hz.i2cBaud = 100000u;
    cfg.baudRate_Hz.i3cPushPullBaud = 1000000u;
    cfg.baudRate_Hz.i3cOpenDrainBaud = 125000u;
    cfg.enableOpenDrainStop = false;
    cfg.disableTimeout = true;
    I3C_MasterInit(TEMP_I3C, &cfg, src_hz);
    s_temp_i3c_inited = true;
    return true;
}

static void BoardTempInit(void)
{
    int32_t temp_c;
    int32_t temp_c10;
    uint8_t addr;
    status_t dyn_status;

    s_temp_ready = false;
    if (!BoardTempI3CInit())
    {
        GaugeRender_SetBoardTempC10(s_temp_c10, false);
        return;
    }

    dyn_status = BoardTempAssignDynamicAddress();
    if ((dyn_status == kStatus_Success) &&
        BoardTempProbeAddr(TEMP_SENSOR_DYNAMIC_ADDR, kI3C_TypeI3CSdr, &temp_c))
    {
        uint8_t raw[2] = {0u, 0u};
        uint16_t temp_f = (uint16_t)(((uint16_t)temp_c * 9u) / 5u + 32u);
        s_temp_addr = TEMP_SENSOR_DYNAMIC_ADDR;
        s_temp_bus_type = kI3C_TypeI3CSdr;
        s_temp_c = (uint8_t)temp_c;
        if (BoardTempReadRaw(TEMP_SENSOR_DYNAMIC_ADDR, kI3C_TypeI3CSdr, raw) &&
            BoardTempDecodeC10(raw, &temp_c10))
        {
            s_temp_c10 = (int16_t)temp_c10;
        }
        else
        {
            s_temp_c10 = (int16_t)s_temp_c * 10;
        }
        s_temp_ready = true;
        if (BoardTempReadRaw(TEMP_SENSOR_DYNAMIC_ADDR, kI3C_TypeI3CSdr, raw))
        {
            PRINTF("TEMP init raw=0x%02x 0x%02x -> %dC/%uF\r\n",
                   (unsigned int)raw[0],
                   (unsigned int)raw[1],
                   (int)s_temp_c,
                   (unsigned int)temp_f);
        }
        PRINTF("TEMP ready dyn=0x%02x bus=i3c T=%dC\r\n", (unsigned int)s_temp_addr, (int)s_temp_c);
    }

    /* Fallback to legacy I2C mode if dynamic mapping fails. */
    if (!s_temp_ready)
    {
        s_temp_bus_type = kI3C_TypeI2C;
        for (addr = 0x48u; addr <= 0x4Bu; addr++)
        {
            PRINTF("TEMP legacy probe addr=0x%02x\r\n", (unsigned int)addr);
            if (BoardTempProbeAddr(addr, kI3C_TypeI2C, &temp_c))
            {
                s_temp_addr = addr;
                s_temp_c = (uint8_t)temp_c;
                s_temp_c10 = (int16_t)s_temp_c * 10;
                s_temp_ready = true;
                break;
            }
        }
    }

    if (!s_temp_ready)
    {
        PRINTF("TEMP sensor not found on I3C1 legacy targets\r\n");
    }
    else
    {
        PRINTF("TEMP ready addr=0x%02x bus=%s T=%dC\r\n",
               (unsigned int)s_temp_addr,
               (s_temp_bus_type == kI3C_TypeI3CSdr) ? "i3c" : "i2c",
               (int)s_temp_c);
    }
    GaugeRender_SetBoardTempC10(s_temp_c10, s_temp_ready);
}

static void BoardTempUpdate(void)
{
    uint8_t raw[2];
    int32_t temp_c;
    int32_t temp_c10;

    if (!s_temp_ready)
    {
        GaugeRender_SetBoardTempC10(s_temp_c10, false);
        return;
    }
    if (!BoardTempReadRaw(s_temp_addr, s_temp_bus_type, raw))
    {
        GaugeRender_SetBoardTempC10(s_temp_c10, false);
        return;
    }
    if (!BoardTempDecodeC(raw, &temp_c) || !BoardTempDecodeC10(raw, &temp_c10))
    {
        GaugeRender_SetBoardTempC10(s_temp_c10, false);
        return;
    }
    if (temp_c < 0)
    {
        temp_c = 0;
    }
    if (temp_c > 99)
    {
        temp_c = 99;
    }
    s_temp_c = (uint8_t)temp_c;
    s_temp_c10 = (int16_t)temp_c10;
    GaugeRender_SetBoardTempC10(s_temp_c10, true);
}

static const power_sample_t *GetFrameSample(void)
{
    const power_sample_t *src = PowerData_Get();
    if (src == NULL)
    {
        return NULL;
    }
    s_frame_sample = *src;
    s_frame_sample.temp_c = s_temp_c;
    ApplyAnomalyToFrame(&s_frame_sample);
    return &s_frame_sample;
}

static bool TouchGetPoint(int32_t *x_out, int32_t *y_out)
{
    touch_point_t points[TOUCH_POINTS];
    uint8_t point_count = TOUCH_POINTS;
    const touch_point_t *selected = NULL;
    int32_t x;
    int32_t y;
    int32_t res_x;
    status_t st = kStatus_Fail;

    if ((x_out == NULL) || (y_out == NULL))
    {
        return false;
    }

    if (!s_touch_ready)
    {
        if (++s_touch_recover_backoff >= 200u)
        {
            s_touch_recover_backoff = 0u;
            TouchInit();
        }
        return false;
    }

    for (uint32_t attempt = 0u; attempt < 6u; attempt++)
    {
        point_count = TOUCH_POINTS;
        st = GT911_GetMultiTouch(&s_touch_handle, &point_count, points);
        if (st == kStatus_Success)
        {
            break;
        }
        if (st != kStatus_TOUCHPANEL_NotReady)
        {
            break;
        }
        SDK_DelayAtLeastUs(800u, CoreClockHz());
    }
    if (st != kStatus_Success)
    {
        if (++s_touch_recover_backoff >= 20u)
        {
            s_touch_recover_backoff = 0u;
            (void)TouchI2CRecover();
            TouchInit();
        }
        return false;
    }
    s_touch_recover_backoff = 0u;

    for (uint8_t i = 0u; i < point_count; i++)
    {
        if (points[i].valid && (points[i].touchID == 0u))
        {
            selected = &points[i];
            break;
        }
    }

    if (selected == NULL)
    {
        for (uint8_t i = 0u; i < point_count; i++)
        {
            if (points[i].valid)
            {
                selected = &points[i];
                break;
            }
        }
    }

    if (selected == NULL)
    {
        return false;
    }

    res_x = (s_touch_handle.resolutionX > 0u) ? (int32_t)s_touch_handle.resolutionX : 480;
    x = (int32_t)selected->y;
    y = res_x - (int32_t)selected->x;

    if (x < 0) x = 0;
    if (x > 479) x = 479;
    if (y < 0) y = 0;
    if (y > 319) y = 319;

    *x_out = x;
    *y_out = y;
    return true;
}

static bool TouchInAiSet(int32_t x, int32_t y)
{
    return (x >= GAUGE_RENDER_AI_SET_X0) && (x <= GAUGE_RENDER_AI_SET_X1) &&
           (y >= GAUGE_RENDER_AI_SET_Y0) && (y <= GAUGE_RENDER_AI_SET_Y1);
}

static bool TouchInAiHelp(int32_t x, int32_t y)
{
    return (x >= GAUGE_RENDER_AI_HELP_X0) && (x <= GAUGE_RENDER_AI_HELP_X1) &&
           (y >= GAUGE_RENDER_AI_HELP_Y0) && (y <= GAUGE_RENDER_AI_HELP_Y1);
}

static bool TouchInSettingsPanel(int32_t x, int32_t y)
{
    return (x >= GAUGE_RENDER_SET_PANEL_X0) && (x <= GAUGE_RENDER_SET_PANEL_X1) &&
           (y >= GAUGE_RENDER_SET_PANEL_Y0) && (y <= GAUGE_RENDER_SET_PANEL_Y1);
}

static bool TouchInHelpPanel(int32_t x, int32_t y)
{
    return (x >= GAUGE_RENDER_HELP_PANEL_X0) && (x <= GAUGE_RENDER_HELP_PANEL_X1) &&
           (y >= GAUGE_RENDER_HELP_PANEL_Y0) && (y <= GAUGE_RENDER_HELP_PANEL_Y1);
}

static bool TouchInSettingsClose(int32_t x, int32_t y)
{
    int32_t bx1 = GAUGE_RENDER_SET_PANEL_X1 - 8;
    int32_t bx0 = bx1 - 22;
    int32_t by0 = GAUGE_RENDER_SET_PANEL_Y0 + 8;
    int32_t by1 = by0 + 22;
    return (x >= bx0) && (x <= bx1) && (y >= by0) && (y <= by1);
}

