telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/src/edgeai_package_transport_anomaly_demo.c
    GaugeRender_SetLimitInfo(s_limit_g_warn_mg, s_limit_g_fail_mg, s_limit_temp_lo_c10, s_limit_temp_hi_c10, s_limit_gyro_dps);
}

int main(void)
{
#if EDGEAI_SENSOR_SCAN_MODE
    return SensorScanModeMain();
#else
    bool ai_enabled = true;
    bool lcd_ok;
    bool ext_flash_ok;
    bool help_visible = false;
    bool settings_visible = false;
    bool limits_visible = false;
    bool ui_block_touch = false;
    bool train_armed_idle = false;
    bool record_mode;
    bool prev_record_mode;
    bool prev_trained_ready;
    bool playback_active = false;
    ext_flash_sample_t playback_sample;
    uint32_t data_tick_accum_us = 0u;
    uint32_t recplay_tick_accum_us = 0u;
    uint32_t render_tick_accum_us = 0u;
    uint32_t accel_sample_tick_accum_us = 0u;
    uint32_t gyro_tick_accum_us = 0u;
    uint32_t accel_live_tick_accum_us = 0u;
    uint32_t runtime_clock_tick_accum_us = 0u;
    uint32_t log_tick_accum_us = 0u;
    uint32_t temp_tick_accum_us = 0u;
    uint32_t shield_aux_tick_accum_us = 0u;
    uint32_t accel_test_tick_accum_us = 0u;
    uint32_t runtime_elapsed_ds = 0u;
    uint32_t runtime_displayed_sec = UINT32_MAX;
    uint32_t rec_elapsed_ds = 0u;
    uint32_t play_off = 0u;
    uint32_t play_cnt = 0u;
    uint32_t rec_cnt = 0u;
    const power_sample_t *sample;
    anomaly_mode_t anom_mode;
    anomaly_tune_t anom_tune;
    uint8_t saved_mode = 0u;
    uint8_t saved_tune = 0u;
    bool saved_run_live = true;
    bool saved_ai = true;
    uint16_t saved_g_warn_mg = 12000u;
    uint16_t saved_g_fail_mg = 15000u;
    int16_t saved_temp_lo_c10 = 0;
    int16_t saved_temp_hi_c10 = 700;
    uint16_t saved_gyro_limit_dps = 500u;
    uint8_t saved_log_rate_hz = 10u;
    bool saved_valid = false;
    uint64_t time_prev_ticks = 0u;
    uint64_t time_us_rem = 0u;
    uint64_t runtime_clock_start_ticks = 0u;

    BOARD_InitHardware();
    ext_flash_ok = ExtFlashRecorder_Init();
    PRINTF("EXT_FLASH_REC: %s\r\n", ext_flash_ok ? "ready" : "init_failed");

    lcd_ok = GaugeRender_Init();
    PRINTF("EV dash LCD: %s\r\n", lcd_ok ? "ready" : "init_failed");
    GaugeRender_SetProfileInfo(EilProfile_GetModelName(), EilProfile_GetModelVersion(), EilProfile_GetExtensionVersion());

    PowerData_Init();
    AnomalyEngine_Init();
    if (ext_flash_ok &&
        ExtFlashRecorder_GetUiSettings(&saved_mode,
                                       &saved_tune,
                                       &saved_run_live,
                                       &saved_ai,
                                       &saved_g_warn_mg,
                                       &saved_g_fail_mg,
                                       &saved_temp_lo_c10,
                                       &saved_temp_hi_c10,
                                       &saved_gyro_limit_dps,
                                       &saved_log_rate_hz,
                                       &saved_valid) &&
        saved_valid)
    {
        if (saved_mode > (uint8_t)ANOMALY_MODE_TRAINED_MONITOR)
        {
            saved_mode = (uint8_t)ANOMALY_MODE_ADAPTIVE_BASELINE;
        }
        if (saved_tune > (uint8_t)ANOMALY_TUNE_STRICT)
        {
            saved_tune = (uint8_t)ANOMALY_TUNE_NORMAL;
        }
        if (saved_g_warn_mg < 500u)
        {
            saved_g_warn_mg = 500u;
        }
        if (saved_g_warn_mg > 15000u)
        {
            saved_g_warn_mg = 15000u;
        }
        if (saved_g_fail_mg < 1000u)
        {
            saved_g_fail_mg = 1000u;
        }
        if (saved_g_fail_mg > 16000u)
        {
            saved_g_fail_mg = 16000u;
        }
        if (saved_g_fail_mg <= saved_g_warn_mg)
        {
            saved_g_fail_mg = saved_g_warn_mg + 500u;
            if (saved_g_fail_mg > 16000u)
            {
                saved_g_fail_mg = 16000u;
            }
        }
        if (saved_temp_lo_c10 < -200)
        {
            saved_temp_lo_c10 = -200;
        }
        if (saved_temp_hi_c10 > 1000)
        {
            saved_temp_hi_c10 = 1000;
        }
        if (saved_temp_hi_c10 <= saved_temp_lo_c10)
        {
            saved_temp_hi_c10 = saved_temp_lo_c10 + 50;
        }
        if (saved_gyro_limit_dps < 100u)
        {
            saved_gyro_limit_dps = 100u;
        }
        if (saved_gyro_limit_dps > 2000u)
        {
            saved_gyro_limit_dps = 2000u;
        }
        saved_log_rate_hz = ClampLogRateHz(saved_log_rate_hz);
        ai_enabled = saved_ai;
        s_limit_g_warn_mg = saved_g_warn_mg;
        s_limit_g_fail_mg = saved_g_fail_mg;
        s_limit_temp_lo_c10 = saved_temp_lo_c10;
        s_limit_temp_hi_c10 = saved_temp_hi_c10;
        s_limit_gyro_dps = saved_gyro_limit_dps;
        s_log_rate_hz = saved_log_rate_hz;
        AnomalyEngine_SetMode((anomaly_mode_t)saved_mode);
        AnomalyEngine_SetTune((anomaly_tune_t)saved_tune);
        GaugeRender_SetLiveBannerMode(saved_run_live);
        PRINTF("UI_CFG_LOAD: mode=%u tune=%u run=%u ai=%u gw=%u gf=%u tl=%d th=%d gy=%u log=%uHz\r\n",
               (unsigned int)saved_mode,
               (unsigned int)saved_tune,
               saved_run_live ? 1u : 0u,
               saved_ai ? 1u : 0u,
               (unsigned int)s_limit_g_warn_mg,
               (unsigned int)s_limit_g_fail_mg,
               (int)(s_limit_temp_lo_c10 / 10),
               (int)(s_limit_temp_hi_c10 / 10),
               (unsigned int)s_limit_gyro_dps,
               (unsigned int)s_log_rate_hz);
    }
    GaugeRender_SetLogRateHz(s_log_rate_hz);
    PowerData_SetAiAssistEnabled(ai_enabled);
    anom_mode = AnomalyEngine_GetMode();
    anom_tune = AnomalyEngine_GetTune();
    ShieldGyroInit();
    ShieldRunDatastreamDiagnostics();
    ShieldSensorScanLog();
    TouchInit();
    BoardTempInit();
    BoardTempUpdate();
    ShieldGyroUpdate();
    ShieldAuxInit();
    (void)TimebaseInit();
    time_prev_ticks = TimebaseNowTicks();
    runtime_clock_start_ticks = time_prev_ticks;
    GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
    GaugeRender_SetHelpVisible(false);
    GaugeRender_SetSettingsVisible(false);
    GaugeRender_SetLimitsVisible(false);
    GaugeRender_SetLiveBannerMode(saved_valid ? saved_run_live : true);
    GaugeRender_SetLimitInfo(s_limit_g_warn_mg,
                             s_limit_g_fail_mg,
                             s_limit_temp_lo_c10,
                             s_limit_temp_hi_c10,
                             s_limit_gyro_dps);
    GaugeRender_SetRecordMode(false);
    memset(&s_anom_out, 0, sizeof(s_anom_out));
    AnomalyEngine_GetOutput(&s_anom_out);
    GaugeRender_SetAnomalyInfo((uint8_t)s_anom_out.mode,
                               (uint8_t)s_anom_out.tune,
                               s_anom_out.training_active,
                               s_anom_out.trained_ready,
                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AX],
                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AY],
                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_AZ],
                               (uint8_t)s_anom_out.channel_level[ANOMALY_CH_TEMP],
                               (uint8_t)s_anom_out.overall_level);
    sample = GetFrameSample();
    if (lcd_ok && (sample != NULL))
    {
        GaugeRender_DrawFrame(sample, ai_enabled, PowerData_GetReplayProfile());
    }
    prev_record_mode = GaugeRender_IsRecordMode();
    prev_trained_ready = s_anom_out.trained_ready;
    if (!prev_record_mode && !GaugeRender_IsLiveBannerMode())
    {
        playback_active = ext_flash_ok && ExtFlashRecorder_StartPlayback();
        runtime_elapsed_ds = 0u;
        runtime_displayed_sec = UINT32_MAX;
        runtime_clock_start_ticks = TimebaseNowTicks();
        GaugeRender_SetRuntimeClock(0u, 0u, 0u, 0u, true);
        PRINTF("EXT_FLASH_PLAY: %s\r\n", playback_active ? "ready" : "no_data");
        if (playback_active && ExtFlashRecorder_GetPlaybackInfo(&play_off, &play_cnt))
        {
            PRINTF("EXT_FLASH_PLAY_INFO: offset=%u count=%u\r\n", (unsigned int)play_off, (unsigned int)play_cnt);
        }
    }

    PRINTF("EV dash app ready\r\n");

    for (;;)
    {
        int32_t tx = 0;
        int32_t ty = 0;
        bool modal_active;
        bool modal_active_now;
        bool pressed = TouchGetPoint(&tx, &ty);
        bool in_set;
        bool in_help;
        bool timeline_changed = GaugeRender_HandleTouch(tx, ty, pressed);
        bool record_start_request;
        bool record_stop_request;
        bool clear_flash_request;

        modal_active = GaugeRender_IsRecordConfirmActive();
        in_set = pressed && !modal_active && TouchInAiSet(tx, ty);
        in_help = pressed && !modal_active && TouchInAiHelp(tx, ty);

        if (help_visible || settings_visible || limits_visible)
        {
            ui_block_touch = false;
        }

        if (ui_block_touch)
        {
            if (!pressed)
            {
                ui_block_touch = false;
            }
            in_set = false;
            in_help = false;
        }

        if (pressed && !s_touch_was_down && !modal_active &&
            (!ui_block_touch || help_visible || settings_visible || limits_visible))
        {
            bool redraw_ui = false;

            if (help_visible)
            {
                if (TouchInHelpClose(tx, ty))
                {
                    help_visible = false;
                    GaugeRender_SetHelpVisible(false);
                    redraw_ui = true;
                }
                else if (TouchInHelpNext(tx, ty) || in_help)
                {
                    GaugeRender_NextHelpPage();
                    redraw_ui = true;
                }
                else if (!TouchInHelpPanel(tx, ty))
                {
                    help_visible = false;
                    GaugeRender_SetHelpVisible(false);
                    redraw_ui = true;
                }
            }
            else if (limits_visible)
            {
                bool handled_limits = false;
                uint8_t lim_idx = 0u;
                bool increase = false;

